espressif/esp-idf/components/soc/esp32h4/include/soc/usb_dwc_struct.h
typedef union {
    struct {
        uint32_t rxfdep: 16;
        uint32_t reserved_16: 16;
    };
    uint32_t val;
} usb_dwc_grxfsiz_reg_t;

typedef union {
    struct {
        uint32_t nptxfstaddr: 16;
        uint32_t nptxfdep: 16;
    };
    uint32_t val;
} usb_dwc_gnptxfsiz_reg_t;

typedef union {
    struct {
        uint32_t nptxfspcavail: 16;
        uint32_t nptxqspcavail: 8;
        uint32_t nptxqtop: 7;
        uint32_t reserved_31: 1;
    };
    uint32_t val;
} usb_dwc_gnptxsts_reg_t;

typedef union {
    struct {
        uint32_t synopsysid;
    };
    uint32_t val;
} usb_dwc_gsnpsid_reg_t;

typedef union {
    struct {
        uint32_t epdir;
    };
    uint32_t val;
} usb_dwc_ghwcfg1_reg_t;

typedef union {
    struct {
        uint32_t otgmode: 3;
        uint32_t otgarch: 2;
        uint32_t singpnt: 1;
        uint32_t hsphytype: 2;
        uint32_t fsphytype: 2;
        uint32_t numdeveps: 4;
        uint32_t numhstchnl: 4;
        uint32_t periosupport: 1;
        uint32_t dynfifosizing: 1;
        uint32_t multiprocintrpt: 1;
        uint32_t reserved_21: 1;
        uint32_t nptxqdepth: 2;
        uint32_t ptxqdepth: 2;
        uint32_t tknqdepth: 5;
        uint32_t reserved_31: 1;
    };
    uint32_t val;
} usb_dwc_ghwcfg2_reg_t;

typedef union {
    struct {
        uint32_t xfersizewidth: 4;
        uint32_t pktsizewidth: 3;
        uint32_t otgen: 1;
        uint32_t i2cintsel: 1;
        uint32_t vndctlsupt: 1;
        uint32_t optfeature: 1;
        uint32_t rsttype: 1;
        uint32_t adpsupport: 1;
        uint32_t hsicmode: 1;
        uint32_t bcsupport: 1;
        uint32_t lpmmode: 1;
        uint32_t dfifodepth: 16;
    };
    uint32_t val;
} usb_dwc_ghwcfg3_reg_t;

typedef union {
    struct {
        uint32_t numdevperioeps: 4;
        uint32_t partialpwrdn: 1;
        uint32_t ahbfreq: 1;
        uint32_t hibernation: 1;
        uint32_t extendedhibernation: 1;
        uint32_t reserved_8: 4;
        uint32_t acgsupt: 1;
        uint32_t enhancedlpmsupt: 1;
        uint32_t phydatawidth: 2;
        uint32_t numctleps: 4;
        uint32_t iddqfltr: 1;
        uint32_t vbusvalidfltr: 1;
        uint32_t avalidfltr: 1;
        uint32_t bvalidfltr: 1;
        uint32_t sessendfltr: 1;
        uint32_t dedfifomode: 1;
        uint32_t ineps: 4;
        uint32_t descdmaenabled: 1;
        uint32_t descdma: 1;
    };
    uint32_t val;
} usb_dwc_ghwcfg4_reg_t;

typedef union {
    struct {
        uint32_t gdfifocfg: 16;
        uint32_t epinfobaseaddr: 16;
    };
    uint32_t val;
} usb_dwc_gdfifocfg_reg_t;

typedef union {
    struct {
        uint32_t ptxfstaddr: 16;
        uint32_t ptxfsize: 16;
    };
    uint32_t val;
} usb_dwc_hptxfsiz_reg_t;

typedef union {
    struct {
        uint32_t inepntxfstaddr: 16;
        uint32_t inepntxfdep: 16;
    };
    uint32_t val;
} usb_dwc_dieptxfi_reg_t;

typedef union {
    struct {
        uint32_t fslspclksel: 2;
        uint32_t fslssupp: 1;
        uint32_t reserved_3: 4;
        uint32_t ena32khzs: 1;
        uint32_t resvalid: 8;
        uint32_t reserved_16: 1;
        uint32_t reserved_17: 6;
        uint32_t descdma: 1;
        uint32_t frlisten: 2;
        uint32_t perschedena: 1;
        uint32_t reserved_27: 4;
        uint32_t modechtimen: 1;
    };
    uint32_t val;
} usb_dwc_hcfg_reg_t;

typedef union {
    struct {
        uint32_t frint: 16;
        uint32_t hfirrldctrl: 1;
        uint32_t reserved_17: 15;
    };
    uint32_t val;
} usb_dwc_hfir_reg_t;

typedef union {
    struct {
        uint32_t frnum: 16;
        uint32_t frrem: 16;
    };
    uint32_t val;
} usb_dwc_hfnum_reg_t;

typedef union {
    struct {
        uint32_t ptxfspcavail: 16;
        uint32_t ptxqspcavail: 8;
        uint32_t ptxqtop: 8;
    };
    uint32_t val;
} usb_dwc_hptxsts_reg_t;

typedef union {
    struct {
        uint32_t haint: 8;
        uint32_t reserved_8: 24;
    };
    uint32_t val;
} usb_dwc_haint_reg_t;

typedef union {
    struct {
        uint32_t haintmsk: 8;
        uint32_t reserved_8: 24;
    };
    uint32_t val;
} usb_dwc_haintmsk_reg_t;

typedef union {
    struct {
        uint32_t hflbaddr;
    };
    uint32_t val;
} usb_dwc_hflbaddr_reg_t;

typedef union {
    struct {
        uint32_t prtconnsts: 1;
        uint32_t prtconndet: 1;
        uint32_t prtena: 1;
        uint32_t prtenchng: 1;
        uint32_t prtovrcurract: 1;
        uint32_t prtovrcurrchng: 1;
        uint32_t prtres: 1;
        uint32_t prtsusp: 1;
        uint32_t prtrst: 1;
        uint32_t reserved_9: 1;
        uint32_t prtlnsts: 2;
        uint32_t prtpwr: 1;
        uint32_t prttstctl: 4;
        uint32_t prtspd: 2;
        uint32_t reserved_19: 13;
    };
    uint32_t val;
} usb_dwc_hprt_reg_t;

typedef union {
    struct {
        uint32_t mps: 11;
        uint32_t epnum: 4;
        uint32_t epdir: 1;
        uint32_t reserved_16: 1;
        uint32_t lspddev: 1;
        uint32_t eptype: 2;
        uint32_t ec: 2;
        uint32_t devaddr: 7;
        uint32_t oddfrm: 1;
        uint32_t chdis: 1;
        uint32_t chena: 1;
    };
    uint32_t val;
} usb_dwc_hcchar_reg_t;

typedef union {
    struct {
        uint32_t xfercompl: 1;
        uint32_t chhltd: 1;
        uint32_t ahberr: 1;
        uint32_t stall: 1;
        uint32_t nack: 1;
        uint32_t ack: 1;
        uint32_t nyet: 1;
        uint32_t xacterr: 1;
        uint32_t bblerr: 1;
        uint32_t frmovrun: 1;
        uint32_t datatglerr: 1;
        uint32_t bnaintr: 1;
        uint32_t xcs_xact_err: 1;
        uint32_t desc_lst_rollintr: 1;
        uint32_t reserved_14: 18;
    };
    uint32_t val;
} usb_dwc_hcint_reg_t;

typedef union {
    struct {
        uint32_t xfercomplmsk: 1;
        uint32_t chhltdmsk: 1;
        uint32_t ahberrmsk: 1;
        uint32_t reserved_3: 1;
        uint32_t reserved_4: 1;
        uint32_t reserved_5: 1;
        uint32_t reserved_6: 1;
        uint32_t reserved_7: 1;
        uint32_t reserved_8: 1;
        uint32_t reserved_9: 1;
        uint32_t reserved_10: 1;
        uint32_t bnaintrmsk: 1;
        uint32_t reserved_12: 1;
        uint32_t desc_lst_rollintrmsk: 1;
        uint32_t reserved_14: 18;
    };
    uint32_t val;
} usb_dwc_hcintmsk_reg_t;

