espressif/esp-idf/components/soc/esp32h4/include/soc/usb_dwc_struct.h
typedef union {
    struct {
        uint32_t dmaaddr;
    };
    uint32_t val;
} usb_dwc_diepdma0_reg_t;

typedef union {
    struct {
        uint32_t ineptxfspcavail: 16;
        uint32_t reserved_16: 16;
    };
    uint32_t val;
} usb_dwc_dtxfsts0_reg_t;

typedef union {
    struct {
        uint32_t dmabufferaddr;
    };
    uint32_t val;
} usb_dwc_diepdmab0_reg_t;

typedef union {
    struct {
        uint32_t mps: 11;
        uint32_t reserved_11: 4;
        uint32_t usbactep: 1;
        uint32_t dpid: 1;
        uint32_t naksts: 1;
        uint32_t eptype: 2;
        uint32_t reserved_20: 1;
        uint32_t stall: 1;
        uint32_t txfnum: 4;
        uint32_t cnak: 1;
        uint32_t snak: 1;
        uint32_t setd0pid: 1;
        uint32_t setd1pid: 1;
        uint32_t epdis: 1;
        uint32_t epena: 1;
    };
    uint32_t val;
} usb_dwc_diepctl_reg_t;

typedef union {
    struct {
        uint32_t xfercompl: 1;
        uint32_t epdisbld: 1;
        uint32_t ahberr: 1;
        uint32_t timeout: 1;
        uint32_t intkntxfemp: 1;
        uint32_t intknepmis: 1;
        uint32_t inepnakeff: 1;
        uint32_t txfemp: 1;
        uint32_t txfifoundrn: 1;
        uint32_t bnaintr: 1;
        uint32_t reserved_10: 1;
        uint32_t pktdrpsts: 1;
        uint32_t bbleerr: 1;
        uint32_t nakintrpt: 1;
        uint32_t nyetintrpt: 1;
        uint32_t reserved_15: 17;
    };
    uint32_t val;
} usb_dwc_diepint_reg_t;

typedef union {
    struct {
        uint32_t xfersize: 19;
        uint32_t pktcnt: 10;
        uint32_t mc: 2;
        uint32_t reserved: 1;
    };
    uint32_t val;
} usb_dwc_dieptsiz_reg_t;

typedef union {
    struct {
        uint32_t dmaddr;
    };
    uint32_t val;
} usb_dwc_diepdma_reg_t;

typedef union {
    struct {
        uint32_t ineptxfspcavail: 16;
        uint32_t reserved_16: 16;
    };
    uint32_t val;
} usb_dwc_dtxfsts_reg_t;

typedef union {
    struct {
        uint32_t dmabufferaddr;
    };
    uint32_t val;
} usb_dwc_diepdmab_reg_t;

typedef union {
    struct {
        uint32_t mps: 2;
        uint32_t reserved_2: 13;
        uint32_t usbactep: 1;
        uint32_t reserved_16: 1;
        uint32_t naksts: 1;
        uint32_t eptype: 2;
        uint32_t snp: 1;
        uint32_t stall: 1;
        uint32_t reserved_22: 4;
        uint32_t cnak: 1;
        uint32_t snak: 1;
        uint32_t reserved_28: 2;
        uint32_t epdis: 1;
        uint32_t epena: 1;
    };
    uint32_t val;
} usb_dwc_doepctl0_reg_t;

typedef union {
    struct {
        uint32_t xfercompl: 1;
        uint32_t epdisbld: 1;
        uint32_t ahberr: 1;
        uint32_t setup: 1;
        uint32_t outtknepdis: 1;
        uint32_t stsphsercvd: 1;
        uint32_t back2backsetup: 1;
        uint32_t reserved_7: 1;
        uint32_t outpkterr: 1;
        uint32_t bnaintr: 1;
        uint32_t reserved_10: 1;
        uint32_t pktdrpsts: 1;
        uint32_t bbleerr: 1;
        uint32_t nakintrpt: 1;
        uint32_t nyepintrpt: 1;
        uint32_t stuppktrcvd: 1;
        uint32_t reserved_16: 16;
    };
    uint32_t val;
} usb_dwc_doepint0_reg_t;

typedef union {
    struct {
        uint32_t xfersize: 7;
        uint32_t reserved_7: 12;
        uint32_t pktcnt: 1;
        uint32_t reserved_20: 9;
        uint32_t supcnt: 2;
        uint32_t reserved_31: 1;
    };
    uint32_t val;
} usb_dwc_doeptsiz0_reg_t;

typedef union {
    struct {
        uint32_t dmaaddr;
    };
    uint32_t val;
} usb_dwc_doepdma0_reg_t;

typedef union {
    struct {
        uint32_t dmabufferaddr;
    };
    uint32_t val;
} usb_dwc_doepdmab0_reg_t;

typedef union {
    struct {
        uint32_t mps: 11;
        uint32_t reserved_11: 4;
        uint32_t usbactep: 1;
        uint32_t dpid: 1;
        uint32_t naksts: 1;
        uint32_t eptype: 2;
        uint32_t snp: 1;
        uint32_t stall: 1;
        uint32_t reserved_22: 4;
        uint32_t cnak: 1;
        uint32_t snak: 1;
        uint32_t setd0pid: 1;
        uint32_t setd1pid: 1;
        uint32_t epdis: 1;
        uint32_t epena: 1;
    };
    uint32_t val;
} usb_dwc_doepctl_reg_t;

typedef union {
    struct {
        uint32_t xfercompl: 1;
        uint32_t epdisbld: 1;
        uint32_t ahberr: 1;
        uint32_t setup: 1;
        uint32_t outtknepdis: 1;
        uint32_t stsphsercvd: 1;
        uint32_t back2backsetup: 1;
        uint32_t reserved_7: 1;
        uint32_t outpkterr: 1;
        uint32_t bnaintr: 1;
        uint32_t reserved_10: 1;
        uint32_t pktdrpsts: 1;
        uint32_t bbleerr: 1;
        uint32_t nakintrpt: 1;
        uint32_t nyetintrpt: 1;
        uint32_t stuppktrcvd: 1;
        uint32_t reserved_16: 16;
    };
    uint32_t val;
} usb_dwc_doepint_reg_t;

typedef union {
    struct {
        uint32_t xfersize: 19;
        uint32_t pktcnt: 10;
        uint32_t rxdpid: 2;
        uint32_t reserved_31: 1;
    };
    uint32_t val;
} usb_dwc_doeptsiz_reg_t;

typedef union {
    struct {
        uint32_t dmaaddr;
    };
    uint32_t val;
} usb_dwc_doepdma_reg_t;

typedef union {
    struct {
        uint32_t dmabufferaddr;
    };
    uint32_t val;
} usb_dwc_doepdmab_reg_t;

typedef union {
    struct {
        uint32_t stoppclk: 1;
        uint32_t gatehclk: 1;
        uint32_t pwrclmp: 1;
        uint32_t rstpdwnmodule: 1;
        uint32_t reserved_4: 1;
        uint32_t reserved_5: 1;
        uint32_t physleep: 1;
        uint32_t l1suspended: 1;
        uint32_t resetaftersusp: 1;
        uint32_t reserved_9: 1;
        uint32_t reserved_10: 1;
        uint32_t reserved_11: 1;
        uint32_t reserved_12: 1;
        uint32_t reserved_13: 1;
        uint32_t reserved_14: 18;
    };
    uint32_t val;
} usb_dwc_pcgcctl_reg_t;

typedef struct {
    volatile usb_dwc_hcchar_reg_t hcchar_reg;
    uint32_t reserved_0x04[1];
    volatile usb_dwc_hcint_reg_t hcint_reg;
    volatile usb_dwc_hcintmsk_reg_t hcintmsk_reg;
    volatile usb_dwc_hctsiz_reg_t hctsiz_reg;
    volatile usb_dwc_hcdma_reg_t hcdma_reg;
    uint32_t reserved_0x18[1];
    volatile usb_dwc_hcdmab_reg_t hcdmab_reg;
} usb_dwc_host_chan_regs_t;

