espressif/esp-idf/components/soc/esp32h4/include/soc/usb_dwc_struct.h
typedef struct {
    volatile usb_dwc_diepctl_reg_t diepctl_reg;
    uint32_t reserved_0x04[1];
    volatile usb_dwc_diepint_reg_t diepint_reg;
    uint32_t reserved_0x0c[1];
    volatile usb_dwc_dieptsiz_reg_t dieptsiz_reg;
    volatile usb_dwc_diepdma_reg_t diepdma_reg;
    volatile usb_dwc_dtxfsts_reg_t dtxfsts_reg;
    volatile usb_dwc_diepdmab_reg_t diepdmab_reg;
} usb_dwc_in_ep_regs_t;

typedef struct {
    volatile usb_dwc_doepctl_reg_t doepctl_reg;
    uint32_t reserved_0x04[1];
    volatile usb_dwc_doepint_reg_t doepint_reg;
    uint32_t reserved_0x0c[1];
    volatile usb_dwc_doeptsiz_reg_t doeptsiz_reg;
    volatile usb_dwc_doepdma_reg_t doepdma_reg;
    uint32_t reserved_0x18[1];
    volatile usb_dwc_doepdmab_reg_t doepdmab_reg;
} usb_dwc_out_ep_regs_t;

typedef struct {
    // Global Registers
    volatile usb_dwc_gotgctl_reg_t gotgctl_reg;             // 0x0000
    volatile usb_dwc_gotgint_reg_t gotgint_reg;             // 0x0004
    volatile usb_dwc_gahbcfg_reg_t gahbcfg_reg;             // 0x0008
    volatile usb_dwc_gusbcfg_reg_t gusbcfg_reg;             // 0x000c
    volatile usb_dwc_grstctl_reg_t grstctl_reg;             // 0x0010
    volatile usb_dwc_gintsts_reg_t gintsts_reg;             // 0x0014
    volatile usb_dwc_gintmsk_reg_t gintmsk_reg;             // 0x0018
    volatile usb_dwc_grxstsr_reg_t grxstsr_reg;             // 0x001c
    volatile usb_dwc_grxstsp_reg_t grxstsp_reg;             // 0x0020
    volatile usb_dwc_grxfsiz_reg_t grxfsiz_reg;             // 0x0024
    volatile usb_dwc_gnptxfsiz_reg_t gnptxfsiz_reg;         // 0x0028
    volatile usb_dwc_gnptxsts_reg_t gnptxsts_reg;           // 0x002c
    uint32_t reserved_0x0030;                               // 0x0030
    uint32_t reserved_0x0034;                               // 0x0034
    uint32_t reserved_0x0038;                               // 0x0038
    uint32_t reserved_0x003c;                               // 0x003c
    volatile usb_dwc_gsnpsid_reg_t gsnpsid_reg;             // 0x0040
    volatile usb_dwc_ghwcfg1_reg_t ghwcfg1_reg;             // 0x0044
    volatile usb_dwc_ghwcfg2_reg_t ghwcfg2_reg;             // 0x0048
    volatile usb_dwc_ghwcfg3_reg_t ghwcfg3_reg;             // 0x004c
    volatile usb_dwc_ghwcfg4_reg_t ghwcfg4_reg;             // 0x0050
    uint32_t reserved_0x0054;                               // 0x0054
    uint32_t reserved_0x0058;                               // 0x0058
    volatile usb_dwc_gdfifocfg_reg_t gdfifocfg_reg;         // 0x005c
    uint32_t reserved_0x0060;                               // 0x0060
    uint32_t reserved_0x0064_0x0100[39];                    // 0x0064 to 0x0100
    volatile usb_dwc_hptxfsiz_reg_t hptxfsiz_reg;           // 0x0100
    volatile usb_dwc_dieptxfi_reg_t dieptxf_regs[4];        // 0x0104 to 0x0110
    usb_dwc_dieptxfi_reg_t reserved_0x0114_0x013c[11];      // 0x0114 to 0x013c
    uint32_t reserved_0x140_0x3fc[176];                     // 0x0140 to 0x03fc

    // Host Mode Registers
    volatile usb_dwc_hcfg_reg_t hcfg_reg;                   // 0x0400
    volatile usb_dwc_hfir_reg_t hfir_reg;                   // 0x0404
    volatile usb_dwc_hfnum_reg_t hfnum_reg;                 // 0x0408
    uint32_t reserved_0x40c[1];                             // 0x040c
    volatile usb_dwc_hptxsts_reg_t hptxsts_reg;             // 0x0410
    volatile usb_dwc_haint_reg_t haint_reg;                 // 0x0414
    volatile usb_dwc_haintmsk_reg_t haintmsk_reg;           // 0x0418
    volatile usb_dwc_hflbaddr_reg_t hflbaddr_reg;           // 0x041c
    uint32_t reserved_0x420_0x43c[8];                       // 0x0420 to 0x043c
    volatile usb_dwc_hprt_reg_t hprt_reg;                   // 0x0440
    uint32_t reserved_0x0444_0x04fc[47];                    // 0x0444 to 0x04fc

    // Host Channel Registers
    usb_dwc_host_chan_regs_t host_chans[8];                 // 0x0500 to 0x05fc
    usb_dwc_host_chan_regs_t reserved_0x0600_0x06fc[8];     // 0x0600 to 0x06fc
    uint32_t reserved_0x0700_0x07fc[64];                    // 0x0700 to 0x07fc

    // Device Mode Registers
    volatile usb_dwc_dcfg_reg_t dcfg_reg;                   // 0x0800
    volatile usb_dwc_dctl_reg_t dctl_reg;                   // 0x0804
    volatile usb_dwc_dsts_reg_t dsts_reg;                   // 0x0808
    uint32_t reserved_0x080c[1];                            // 0x080c
    volatile usb_dwc_diepmsk_reg_t diepmsk_reg;             // 0x0810
    volatile usb_dwc_doepmsk_reg_t doepmsk_reg;             // 0x0814
    volatile usb_dwc_daint_reg_t daint_reg;                 // 0x0818
    volatile usb_dwc_daintmsk_reg_t daintmsk_reg;           // 0x081c
    uint32_t reserved_0x0820;                               // 0x0820
    uint32_t reserved_0x0824;                               // 0x0824
    volatile usb_dwc_dvbusdis_reg_t dvbusdis_reg;           // 0x0828
    volatile usb_dwc_dvbuspulse_reg_t dvbuspulse_reg;       // 0x082c
    volatile usb_dwc_dthrctl_reg_t dthrctl_reg;             // 0x0830
    volatile usb_dwc_diepempmsk_reg_t diepempmsk_reg;       // 0x0834
    uint32_t reserved_0x0838;                               // 0x0838
    uint32_t reserved_0x083c;                               // 0x083c
    uint32_t reserved_0x0840;                               // 0x0840
    uint32_t reserved_0x0844_0x087c[15];                    // 0x0844 to 0x087c
    uint32_t reserved_0x0880;                               // 0x0880
    uint32_t reserved_0x0884_0x08c0[15];                    // 0x0884 to 0x08c0
    uint32_t reserved_0x08c4_0x08fc[16];                    // 0x08c4 to 0x08fc

    // Device: IN EP0 registers
    volatile usb_dwc_diepctl0_reg_t diepctl0_reg;           // 0x0900
    uint32_t reserved_0x0904[1];                            // 0x0904
    volatile usb_dwc_diepint0_reg_t diepint0_reg;           // 0x0908
    uint32_t reserved_0x090c[1];                            // 0x090c
    volatile usb_dwc_dieptsiz0_reg_t dieptsiz0_reg;         // 0x0910
    volatile usb_dwc_diepdma0_reg_t diepdma0_reg;           // 0x0914
    volatile usb_dwc_dtxfsts0_reg_t dtxfsts0_reg;           // 0x0918
    volatile usb_dwc_diepdmab0_reg_t diepdmab0_reg;         // 0x091c

    // Device: IN EP registers
    usb_dwc_in_ep_regs_t in_eps[6];                         // 0x0920 to 0x09dc
    usb_dwc_in_ep_regs_t reserved_0x09e0_0x0afc[9];         // 0x09e0 to 0x0afc

    // Device: OUT EP0 registers
    volatile usb_dwc_doepctl0_reg_t doepctl0_reg;           // 0x0b00
    uint32_t reserved_0x0b04[1];                            // 0x0b04
    volatile usb_dwc_doepint0_reg_t doepint0_reg;           // 0b0b08
    uint32_t reserved_0x0b0c[1];                            // 0x0b0c
    volatile usb_dwc_doeptsiz0_reg_t doeptsiz0_reg;         // 0x0b10
    volatile usb_dwc_doepdma0_reg_t doepdma0_reg;           // 0x0b14
    uint32_t reserved_0x0b18[1];                            // 0x0b18
    volatile usb_dwc_doepdmab0_reg_t doepdmab0_reg;         // 0x0b1c

    // Device: OUT EP registers
    usb_dwc_out_ep_regs_t out_eps[6];                       // 0x0b20 to 0x0bdc
    usb_dwc_out_ep_regs_t reserved_0x0be0_0x0d00[9];        // 0x0be0 to 0x0cfc
    uint32_t reserved_0x0d00_0x0dfc[64];                    // 0x0d00 to 0x0dfc

    // Power and Clock Gating
    volatile usb_dwc_pcgcctl_reg_t pcgcctl_reg;             // 0x0e00
    uint32_t reserved_0x0e04[1];                            // 0x0e04

} usb_dwc_dev_t;

#ifndef __cplusplus
_Static_assert(sizeof(usb_dwc_dev_t) == 0xe08, "Invalid size of usb_dwc_dev_t structure");
#endif

extern usb_dwc_dev_t USB_DWC;

#ifdef __cplusplus
}
#endif
